
//路径配置
require.config({
	paths : {
		'echarts' : './echarts/echarts',
		'echarts/chart/line' : './echarts/echarts',
		'echarts/chart/map' : './echarts/echarts-map'
	}
});

// 使用
require([ 'echarts', 'echarts/chart/map' // 使用柱状图就加载map模块，按需加载
], function(ec) {
	// 初始化e charts图表
	var myChart = ec.init(document.getElementById('map'));
	
	var str = '';
	function getData() {
		var obj = new Array;
		$.ajax({
			url : encodeURI("Echarts?method=getMood"),
			type : "GET",
			dataType : "text",
			cache : false,
			async : false,
			success : function(data) {
				obj = eval("(" + data + ")");
				console.log(data);
			},
			error : function(data) {
				alert("返回数据失败！");
			}
		});
		return obj;
	}
	
	function show(){
			$.ajax({
				url : encodeURI("Echarts?method=getProvince"),
				type : "GET",
				dataType : "json",
				cache : false,
				async : false,
				success : function(data) {
		            var list = data; 
		            $('#test-province').text(list[0]);
		            $('#test-value1').text(list[1]);
		            $('#test-value2').text(list[2]);
		            $('#test-value3').text(list[3]);
		            $('#test-value4').text(list[4]);
		            $('#test-value5').text(list[5]);
		            $('#test-value6').text(list[6]);
				},
				error : function(data) {
					alert("返回数据失败！");
				}
			});
		}

	show();
	var option = {
			backgroundColor : '#1b1b1b',  //设置背景
		    tooltip : {
		        trigger: 'item',
		        formatter: '{b}',
		    },
		    title : {                       //标题
				text : '当前社会形势',
				subtext : '',
				x : 'center',
				textStyle : {
					color : 'white',
				}
			},
			dataRange : {   //调节框
				orient: 'horizontal',
				min : 0,
				max : 100,
				text : [ '严重危险', '理想稳定' ], // 干预强干预弱
				calculable : false,
				splitNumber:10,
				color : [ '#EE0000', '#EE4000', '#EE6AA7', '#EE799F', '#EE9572','#EEA9B8','#EECFA1' ,'#EEE5DE','#D1EEEE','#90EE90'],
				textStyle : {
					color : '#fff',
				}
			},
		    series : [
		        {
		            name: '中国',
		            type: 'map',
		            mapType: 'china',
		            
//		            selectedMode : 'single',
		            itemStyle : {
						normal : {
//							selectedMode : 'single',
							borderColor : 'white',
							label:{
								    show:true,
								    textStyle : {
									color : 'lightblue',
								    }
							     },
							borderWidth : 0.5,
							areaStyle : {
								color : '#1b1b1b',
							}
						}
					},
		            data:[],
		            geoCoord : {
						'上海' : [ 121.4648, 31.2891 ],
						'东莞' : [ 113.8953, 22.901 ],
						'东营' : [ 118.7073, 37.5513 ],
						'中山' : [ 113.4229, 22.478 ],
						'临汾' : [ 111.4783, 36.1615 ],
						'临沂' : [ 118.3118, 35.2936 ],
						'丹东' : [ 124.541, 40.4242 ],
						'丽水' : [ 119.5642, 28.1854 ],
						'新疆' : [ 87.9236, 43.5883 ],
						'佛山' : [ 112.8955, 23.1097 ],
						'保定' : [ 115.0488, 39.0948 ],
						'甘肃' : [ 103.5901, 36.3043 ],
						'包头' : [ 110.3467, 41.4899 ],
						'北京' : [ 116.4551, 40.2539 ],
						'北海' : [ 109.314, 21.6211 ],
						'南京' : [ 118.8062, 31.9208 ],
						'江苏' : [ 118.8062, 31.9208 ],
						'南宁' : [ 108.479, 23.1152 ],
						'广西' : [ 108.479, 23.1152 ],
						'江西' : [ 116.0046, 28.6633 ],
						'南昌' : [ 116.0046, 28.6633 ],
						'南通' : [ 121.1023, 32.1625 ],
						'厦门' : [ 118.1689, 24.6478 ],
						'福建' : [ 118.1689, 24.6478 ],
						'台州' : [ 121.1353, 28.6688 ],
						'合肥' : [ 117.29, 32.0581 ],
						'安徽' : [ 117.29, 32.0581 ],
						'呼和浩特' : [ 111.4124, 40.4901 ],
						'内蒙古' : [ 111.4124, 40.4901 ],
						'咸阳' : [ 108.4131, 34.8706 ],
						'哈尔滨' : [ 127.9688, 45.368 ],
						'黑龙江' : [ 127.9688, 45.368 ],
						'唐山' : [ 118.4766, 39.6826 ],
						'嘉兴' : [ 120.9155, 30.6354 ],
						'大同' : [ 113.7854, 39.8035 ],
						'天津' : [ 117.4219, 39.4189 ],
						'太原' : [ 112.3352, 37.9413 ],
						'山西' : [ 112.3352, 37.9413 ],
						'威海' : [ 121.9482, 37.1393 ],
						'宁波' : [ 121.5967, 29.6466 ],
						'宝鸡' : [ 107.1826, 34.3433 ],
						'宿迁' : [ 118.5535, 33.7775 ],
						'常州' : [ 119.4543, 31.5582 ],
						'广州' : [ 113.5107, 23.2196 ],
						'广东' : [ 113.5107, 23.2196 ],
						'廊坊' : [ 116.521, 39.0509 ],
						'延安' : [ 109.1052, 36.4252 ],
						'张家口' : [ 115.1477, 40.8527 ],
						'徐州' : [ 117.5208, 34.3268 ],
						'德州' : [ 116.6858, 37.2107 ],
						'惠州' : [ 114.6204, 23.1647 ],
						'四川' : [ 103.9526, 30.7617 ],
						'扬州' : [ 119.4653, 32.8162 ],
						'承德' : [ 117.5757, 41.4075 ],
						'西藏' : [ 91.1865, 30.1465 ],
						'无锡' : [ 120.3442, 31.5527 ],
						'日照' : [ 119.2786, 35.5023 ],
						'云南' : [ 102.9199, 25.4663 ],
						'杭州' : [ 119.5313, 29.8773 ],
						'浙江' : [ 119.5313, 29.8773 ],
						'枣庄' : [ 117.323, 34.8926 ],
						'柳州' : [ 109.3799, 24.9774 ],
						'株洲' : [ 113.5327, 27.0319 ],
						'武汉' : [ 114.3896, 30.6628 ],
						'湖北' : [ 114.3896, 30.6628 ],
						'汕头' : [ 117.1692, 23.3405 ],
						'江门' : [ 112.6318, 22.1484 ],
						'沈阳' : [ 123.1238, 42.1216 ],
						'辽宁' : [ 123.1238, 42.1216 ],
						'沧州' : [ 116.8286, 38.2104 ],
						'河源' : [ 114.917, 23.9722 ],
						'泉州' : [ 118.3228, 25.1147 ],
						'泰安' : [ 117.0264, 36.0516 ],
						'泰州' : [ 120.0586, 32.5525 ],
						'济南' : [ 117.1582, 36.8701 ],
						'山东' : [ 117.1582, 36.8701 ],
						'济宁' : [ 116.8286, 35.3375 ],
						'海口' : [ 110.3893, 19.8516 ],
						'海南' : [ 110.3893, 19.8516 ],
						'淄博' : [ 118.0371, 36.6064 ],
						'淮安' : [ 118.927, 33.4039 ],
						'深圳' : [ 114.5435, 22.5439 ],
						'清远' : [ 112.9175, 24.3292 ],
						'温州' : [ 120.498, 27.8119 ],
						'渭南' : [ 109.7864, 35.0299 ],
						'湖州' : [ 119.8608, 30.7782 ],
						'湘潭' : [ 112.5439, 27.7075 ],
						'滨州' : [ 117.8174, 37.4963 ],
						'潍坊' : [ 119.0918, 36.524 ],
						'烟台' : [ 120.7397, 37.5128 ],
						'玉溪' : [ 101.9312, 23.8898 ],
						'珠海' : [ 113.7305, 22.1155 ],
						'盐城' : [ 120.2234, 33.5577 ],
						'盘锦' : [ 121.9482, 41.0449 ],
						'石家庄' : [ 114.4995, 38.1006 ],
						'河北' : [ 114.4995, 38.1006 ],
						'福州' : [ 119.4543, 25.9222 ],
						'秦皇岛' : [ 119.2126, 40.0232 ],
						'绍兴' : [ 120.564, 29.7565 ],
						'聊城' : [ 115.9167, 36.4032 ],
						'肇庆' : [ 112.1265, 23.5822 ],
						'舟山' : [ 122.2559, 30.2234 ],
						'苏州' : [ 120.6519, 31.3989 ],
						'莱芜' : [ 117.6526, 36.2714 ],
						'菏泽' : [ 115.6201, 35.2057 ],
						'营口' : [ 122.4316, 40.4297 ],
						'葫芦岛' : [ 120.1575, 40.578 ],
						'衡水' : [ 115.8838, 37.7161 ],
						'衢州' : [ 118.6853, 28.8666 ],
						'青海' : [ 101.4038, 36.8207 ],
						'西安' : [ 109.1162, 34.2004 ],
						'陕西' : [ 109.1162, 34.2004 ],
						'贵阳' : [ 106.6992, 26.7682 ],
						'贵州' : [ 106.6992, 26.7682 ],
						'连云港' : [ 119.1248, 34.552 ],
						'邢台' : [ 114.8071, 37.2821 ],
						'邯郸' : [ 114.4775, 36.535 ],
						'郑州' : [ 113.4668, 34.6234 ],
						'河南' : [ 113.4668, 34.6234 ],
						'鄂尔多斯' : [ 108.9734, 39.2487 ],
						'重庆' : [ 107.7539, 30.1904 ],
						'金华' : [ 120.0037, 29.1028 ],
						'铜川' : [ 109.0393, 35.1947 ],
						'银川' : [ 106.3586, 38.1775 ],
						'宁夏' : [ 106.3586, 38.1775 ],
						'镇江' : [ 119.4763, 31.9702 ],
						'长春' : [ 125.8154, 44.2584 ],
						'吉林' : [ 125.8154, 44.2584 ],
						'长沙' : [ 113.0823, 28.2568 ],
						'湖南' : [ 113.0823, 28.2568 ],
						'长治' : [ 112.8625, 36.4746 ],
						'阳泉' : [ 113.4778, 38.0951 ],
						'青岛' : [ 120.4651, 36.3373 ],
						'韶关' : [ 113.7964, 24.7028 ],
						'香港' : [ 114.1041, 22.1810 ],
						'澳门' : [ 113.3247, 22.1105 ],
						'台湾' : [ 121.3022, 25.0200 ]
					}  //预加载数据结束
		        
		        },  //series第一项结束
		        {
					name : '社会形势研判',
					type : 'map',
					mapType : 'china',
					data : [],
					markPoint : {
						symbol : 'emptyCircle',
						symbolSize : function(v) {
							return 5 + v / 5;
						},
						effect : {
							show : true,
							shadowBlur : 0
						},
						itemStyle : {
							normal : {
								label : {
									show : true
								}
							}
						},
						data : getData()
					}
				} //社会形势研判结束
		    ]  //series结束
		}; //option结束
//		var ecConfig = require('echarts/config');
//		myChart.on(ecConfig.EVENT.MAP_SELECTED, function (param){
//		    var selected = param.selected;
//		    str="";
//		    for (var p in selected) {
//		        if (selected[p]) {
//		            str += p + '';
//		        }
//		    }  		
//		    document.getElementById('test-province').innerHTML = str;
//            show();
//		});      
//       show();
	myChart.setOption(option,false);
});